[
  {
    "slug": "wild-mushroom-soup",
    "title": "Wild Mushroom Soup",
    "description": "A rich and creamy soup featuring an array of wild mushrooms, perfect for cozy winter nights and special occasions.",
    "image": "/wild-mushroom-soup.jpg",
    "cookingTime": "About 1 hour and 15 minutes",
    "servings": "Serves 6",
    "ingredients": [
      "8 oz shiitake mushrooms",
      "8 oz cremini mushrooms",
      "8 oz portabella mushrooms",
      "2 packets (3 oz each) dried porcini and morel mushrooms, reconstituted in 8 oz hot water",
      "1/2 cup mirepoix (carrot/onion/celery, chopped)",
      "2 cups chopped leeks (white and light green only)",
      "1/4 cup flour",
      "1 cup dry white wine",
      "1 cup half and half",
      "1 cup heavy cream",
      "1/2 cup chopped flat leaf parsley",
      "40 oz chicken stock",
      "1/2 cup porcini soaking liquid, strained through cheesecloth",
      "2 medium shallots",
      "1 tablespoon thyme",
      "3 tablespoons olive oil",
      "2 tablespoons butter",
      "2 cloves of garlic",
      "Salt and pepper"
    ],
    "directions": [
      "In a large pot or Dutch oven, heat olive oil and butter over medium heat. Sauté the mirepoix and garlic until fragrant.",
      "Add shallots and sauté.",
      "Add mushrooms and leeks, including the reconstituted porcini and morel mushrooms, chopped and stems removed.",
      "Sauté for 5 minutes, then add wine and cook for an additional 3-4 minutes.",
      "Sprinkle in flour and mix well, cooking for 2 minutes.",
      "Add chicken stock and strained porcini liquid. Bring to a boil, stirring. Reduce heat to medium and simmer with lid on for 10-15 minutes until the sauce thickens.",
      "Reduce heat and blend in cream and half and half. Do not boil. Add salt and pepper to taste.",
      "Stir in parsley and fresh thyme.",
      "Serve."
    ],
    "quote": "Love deeply, recklessly, with wild abandon, give of your whole self – it’s risky – you will likely be hurt but there is nothing in life more beautiful or more special."
  },
  {
    "slug": "roasted-butternut-squash-soup-with-sage-and-truffle-oil",
    "title": "Roasted Butternut Squash Soup with Sage and Truffle Oil",
    "description": "A savory soup featuring roasted butternut squash, aromatic sage, and a drizzle of rich truffle oil, perfect for a cozy evening.",
    "image": "/roasted-butternut-squash-soup-with-sage-and-truffle-oil.jpg",
    "cookingTime": "Approximately 1 hour",
    "servings": "Serves 4",
    "ingredients": [
      "2 butternut squash (about 3 lbs)",
      "2 shallots, minced",
      "1 carrot, chopped",
      "1 celery stalk, chopped",
      "1 cinnamon stick",
      "1/4 stick butter, plus 3 tablespoons",
      "1/2 apple, minced",
      "28-30 oz chicken stock or vegetable stock",
      "Salt and pepper",
      "Sage leaves (3 per serving)",
      "Truffle oil"
    ],
    "directions": [
      "Preheat oven to 425°F.",
      "Line a baking sheet with parchment paper.",
      "Halve the squash lengthwise and remove seeds.",
      "Season cut side with salt and pepper.",
      "Place squash cut side down, coat skin with olive oil, and roast for 30 minutes.",
      "Scoop roasted squash into a bowl after it cools slightly.",
      "In a pot, sauté shallots, apples, celery, and carrot in 1/4 cup butter until soft, about 4-5 minutes.",
      "Add roasted squash and chicken or vegetable stock (20-28 oz).",
      "Add cinnamon stick and simmer for 30 minutes.",
      "Remove cinnamon stick.",
      "Blend the mixture until smooth using a hand emulsifier or blender.",
      "Flash-fry sage leaves in 3 tablespoons of browned butter.",
      "Plate the soup, add fried sage leaves, and drizzle with truffle oil."
    ],
    "quote": "Use sunscreen! Re-apply. Those that love me know why."
  }
]
