[
  {
    "slug": "roasted-garlic-soup",
    "title": "Roasted Garlic Soup with Baby Kale, Baby Spinach and Pancetta",
    "description": "A rich and flavorful soup featuring roasted garlic, greens, and crispy pancetta for a comforting dish.",
    "image": "/roasted-garlic-soup.jpg",
    "cookingTime": "1 hour",
    "servings": "4",
    "ingredients": [
      "6 heads of garlic (YES! Six full heads - not cloves)",
      "plus 4 cloves of garlic",
      "2 tablespoons olive oil",
      "8 oz diced pancetta",
      "1 small onion, chopped",
      "4 cups chicken stock",
      "1/2 cup parmesan cheese, grated",
      "1 cup baby kale",
      "1 cup baby spinach",
      "1 cup heavy cream"
    ],
    "directions": [
      "Pre-heat oven to 350 degrees F.",
      "Trim tops of garlic heads, drizzle with olive oil, salt, and pepper. Wrap in foil and roast for 45 minutes. Let cool.",
      "In a large pot, cook pancetta until crispy. Remove pancetta, retain 2 tablespoons of fat.",
      "Sauté chopped onion and minced 4 cloves of garlic for about 10 minutes.",
      "Squeeze roasted garlic cloves into the pot with the onions.",
      "Add chicken stock and puree until smooth.",
      "Bring to a simmer. Add parmesan, spinach, and kale. Simmer for 5 minutes stirring occasionally.",
      "Add cream.",
      "Serve in bowls. Sprinkling pancetta into each bowl."
    ],
    "quote": "Dress – you can never be overdressed. Men: blue suit, gray suit, white shirt, blue shirt only, no ties with pictures or words. Shoes brown or black with a shine. Yes you wear brown shoes with a blue suit. Shine your dress shoes! Women: always have a small black dress otherwise you allknow what you’re doing. Let’s face it, you’re smarter than boys."
  },
  {
    "slug": "mac-and-cheese",
    "title": "Mac & Cheese",
    "description": "Everyone’s favorite and you can make it your own or mix it up with additions such as truffle, bacon, crab, lobster…well, you get the idea. For me, less is more, so I like this simple version. Feel free to mix-up the cheeses, although Le Gruyere is king, and change the pasta.",
    "image": "/mac-and-cheese.jpg",
    "cookingTime": "45 minutes",
    "servings": "6",
    "ingredients": [
      "1 lb campanelle pasta",
      "2 cups whole milk",
      "2 cups half and half",
      "1/2 cup unsalted butter",
      "4 cups sharp cheddar, shredded",
      "2 cups shredded le gruyere",
      "1/2 cup flour",
      "1/2 teaspoon paprika",
      "Salt",
      "Pepper"
    ],
    "directions": [
      "Cook your pasta in boiling salted water (no oil ever) for half the time noted. You’re going to bake it so you don’t want to overcook. Drain, don’t rinse. Return to empty pot.",
      "Then melt the butter in a sauce pan –medium heat. Slowly blend in the flour. About a minute. Use a whisk.",
      "Then begin to add your mixture of milk and half and half. Slowly whisk to prevent clumps. Add salt, pepper and paprika.",
      "Your cheeses should be combined and separated into two piles. Blend one pile into the cream and stir until melted and creamy cheesy mixture to pasta pot and blend.",
      "In a 3 quart greased casserole pan, add half the creamy pasta. Then add half the remaining shredded cheeses. Add the remaining pasta then top with remaining cheese.",
      "Bake at 325 degrees F for 15 minutes.",
      "I like to add butter toasted panko to the top, but I do that in a pan and add at the end. This way you still get the toasty cheese topping plus the panko. About ¾ cup of panko toasted in a pan with 2 tablespoons of butter.",
      "Enjoy!"
    ],
    "quote": "Neighbors. Shovel your neighbor’s sidewalk."
  },
  {
    "slug": "wild-mushroom-soup",
    "title": "Wild Mushroom Soup",
    "description": "A rich and creamy soup featuring an array of wild mushrooms, perfect for cozy winter nights and special occasions.",
    "image": "/wild-mushroom-soup.jpg",
    "cookingTime": "About 1 hour and 15 minutes",
    "servings": "Serves 6",
    "ingredients": [
      "8 oz shiitake mushrooms",
      "8 oz cremini mushrooms",
      "8 oz portabella mushrooms",
      "2 packets (3 oz each) dried porcini and morel mushrooms, reconstituted in 8 oz hot water",
      "1/2 cup mirepoix (carrot/onion/celery, chopped)",
      "2 cups chopped leeks (white and light green only)",
      "1/4 cup flour",
      "1 cup dry white wine",
      "1 cup half and half",
      "1 cup heavy cream",
      "1/2 cup chopped flat leaf parsley",
      "40 oz chicken stock",
      "1/2 cup porcini soaking liquid, strained through cheesecloth",
      "2 medium shallots",
      "1 tablespoon thyme",
      "3 tablespoons olive oil",
      "2 tablespoons butter",
      "2 cloves of garlic",
      "Salt and pepper"
    ],
    "directions": [
      "In a large pot or Dutch oven, heat olive oil and butter over medium heat. Sauté the mirepoix and garlic until fragrant.",
      "Add shallots and sauté.",
      "Add mushrooms and leeks, including the reconstituted porcini and morel mushrooms, chopped and stems removed.",
      "Sauté for 5 minutes, then add wine and cook for an additional 3-4 minutes.",
      "Sprinkle in flour and mix well, cooking for 2 minutes.",
      "Add chicken stock and strained porcini liquid. Bring to a boil, stirring. Reduce heat to medium and simmer with lid on for 10-15 minutes until the sauce thickens.",
      "Reduce heat and blend in cream and half and half. Do not boil. Add salt and pepper to taste.",
      "Stir in parsley and fresh thyme.",
      "Serve."
    ],
    "quote": "Love deeply, recklessly, with wild abandon, give of your whole self – it’s risky – you will likely be hurt but there is nothing in life more beautiful or more special."
  },
  {
    "slug": "roasted-butternut-squash-soup-with-sage-and-truffle-oil",
    "title": "Roasted Butternut Squash Soup with Sage and Truffle Oil",
    "description": "A savory soup featuring roasted butternut squash, aromatic sage, and a drizzle of rich truffle oil, perfect for a cozy evening.",
    "image": "https://example.com/images/roasted-butternut-squash-soup.jpg",
    "cookingTime": "Approximately 1 hour",
    "servings": "Serves 4",
    "ingredients": [
      "2 butternut squash (about 3 lbs)",
      "2 shallots, minced",
      "1 carrot, chopped",
      "1 celery stalk, chopped",
      "1 cinnamon stick",
      "1/4 stick butter, plus 3 tablespoons",
      "1/2 apple, minced",
      "28-30 oz chicken stock or vegetable stock",
      "Salt and pepper",
      "Sage leaves (3 per serving)",
      "Truffle oil"
    ],
    "directions": [
      "Preheat oven to 425°F.",
      "Line a baking sheet with parchment paper.",
      "Halve the squash lengthwise and remove seeds.",
      "Season cut side with salt and pepper.",
      "Place squash cut side down, coat skin with olive oil, and roast for 30 minutes.",
      "Scoop roasted squash into a bowl after it cools slightly.",
      "In a pot, sauté shallots, apples, celery, and carrot in 1/4 cup butter until soft, about 4-5 minutes.",
      "Add roasted squash and chicken or vegetable stock (20-28 oz).",
      "Add cinnamon stick and simmer for 30 minutes.",
      "Remove cinnamon stick.",
      "Blend the mixture until smooth using a hand emulsifier or blender.",
      "Flash-fry sage leaves in 3 tablespoons of browned butter.",
      "Plate the soup, add fried sage leaves, and drizzle with truffle oil."
    ],
    "quote": "Use sunscreen! Re-apply. Those that love me know why."
  },
  {
    "slug": "tuna-tartare",
    "title": "Tuna Tartare",
    "description": "A delicious and refined dish featuring sushi-grade tuna with mint, pear, and a hint of paprika.",
    "image": "/tuna-tartare.jpg",
    "cookingTime": "15 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1 lb Shushi grade tuna (ask for a block cut)",
      "1/4 c. pine nuts",
      "2 Tbs minced pear",
      "1 Tbs thinly julienned fresh mint leaves",
      "2 Tbs hot sesame seed oil",
      "1 Tbs plain sesame seed oil",
      "1 egg yolk",
      "1 tsp paprika",
      "Sea salt to taste"
    ],
    "directions": [
      "Mince tuna, removing silver skin if necessary. (You can use your knife blade to remove the fish from the silver skin.)",
      "Toast pine nuts in a small pan over medium heat (must watch this carefully).",
      "Combine all ingredients with your hands, and plate the tartare.",
      "Lightly coat with paprika and sea salt.",
      "Serve with toast points."
    ],
    "quote": "Competition: the World is your arena to compete. Your home is not. Your home is where you strip your armor and unload your weapons. Everyone there is on the same team."
  },
  {
    "slug": "beans-and-greens",
    "title": "Beans and Greens",
    "description": "A hearty and flavorful dish combining a variety of greens and beans, perfect for a nutritious meal.",
    "image": "/beans-and-greens.jpg",
    "cookingTime": "30 minutes",
    "servings": "4-6 servings",
    "ingredients": [
      "Greens - lots - you can mix it up but I like escarole, baby spinach, baby kale, dandelion, and Swiss chard finished with fresh chopped basil",
      "Beans - stick with white beans like garbanzos (chickpeas) and cannellini - 1 can of each (15.5 oz) rinsed",
      "2 Tbs olive oil",
      "1 large yellow onion sliced on the vertical",
      "5 cloves of minced garlic",
      "1 tsp red pepper flakes",
      "3/4 lb of mild Italian sausage (optional)",
      "1/2 c. beef or vegetable stock",
      "Parmesan-reggiano to taste",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Heat a cast iron skillet to medium high. Add 2 tablespoons of olive oil.",
      "Add one teaspoon red pepper flakes.",
      "Brown crumbled sausage (if using). Crispy is best.",
      "Add sliced onion and saute until caramelized. You will want to turn down the heat.",
      "Add minced garlic. Saute until fragrant.",
      "Add 1/2 cup of beef or vegetable stock.",
      "Add Swiss chard and any other healthy greens. Saute.",
      "Then add baby spinach and baby kale plus half your bean mixture.",
      "Saute - do not overcook.",
      "Plate.",
      "Top with 3/4 cup of chopped fresh basil and add the other half of the bean mixture.",
      "Cheese to taste.",
      "Salt and pepper to taste.",
      "Enjoy!"
    ],
    "quote": "Never miss an opportunity to express your love even if that love is unrequited. For love is a gift. Not often felt. Don’t miss the opportunity."
  },
  {
    "slug": "stuffed-poblano-peppers",
    "title": "Stuffed Poblano Peppers",
    "description": "A flavorful dish using mild poblanos stuffed with sausage, topped with tomato sauce and mozzarella.",
    "image": "/stuffed-poblano-peppers.jpg",
    "cookingTime": "50 minutes",
    "servings": "4-6 servings",
    "ingredients": [
      "4 peppers or more",
      "1 ½ lb sausage of your choosing",
      "28 oz can of good tomato sauce such as Pomodoro S. Manzano",
      "Mozzarella shredded cheese",
      "Olive oil"
    ],
    "directions": [
      "Heat oven to 350 degrees. Cap peppers and remove the seeds. Stuff peppers with sausage (try to get the sausage down into the tip).",
      "In a baking pan, drizzle stuffed poblanos with olive oil and bake for 20 minutes. Then add tomato sauce. Bake for another 15 minutes. Top with mozzarella cheese. Bake another 5-10 minutes.",
      "That’s it! Serve it as an appetizer or even a meal on a fall day."
    ],
    "quote": "Share your day with those you love. Your life is in the details and those that love you want the details."
  },
  {
    "slug": "caesar-salad",
    "title": "Caesar Salad",
    "description": "A classic Caesar salad with homemade dressing, perfect for a fresh and delicious starter.",
    "image": "/caesar-salad.jpg",
    "cookingTime": "15 minutes",
    "servings": "4 servings",
    "ingredients": [
      "Romaine lettuce - for 4 people",
      "Olive oil (extra virgin)",
      "Balsamic vinegar (good quality) or red wine vinegar",
      "4 Anchovy filets",
      "3 cloves of garlic minced",
      "1 tsp grey poupon",
      "Lemon",
      "1/3 c. grated parmesan",
      "1 egg",
      "Large Texas toast croutons",
      "Kosher salt",
      "Cracked black pepper",
      "Shaved parmesan to taste"
    ],
    "directions": [
      "Spritz 4 filets with fresh lemon. Let rest.",
      "In a large wooden bowl, mince 3 garlic cloves in the bottom of the bowl using a small amount of kosher salt to assist in mincing.",
      "Add anchovies and mince with garlic until a paste is formed.",
      "Add a teaspoon of Dijon mustard and blend in with fork.",
      "Add 3-4 tablespoons of olive oil.",
      "Add 3-4 tablespoons of balsamic (or red wine vinegar).",
      "Mix well.",
      "Add egg and mix.",
      "Kosher salt and cracked black pepper to taste.",
      "Add romaine torn into small pieces.",
      "Add parmesan cheese (about 1/3 cup) and mix (coating romaine).",
      "Add croutons - mix.",
      "Serve with shaved parmesan on top to finish."
    ],
    "quote": "When you think of “the best of times and the worst of times” it won’t be where you are or what you have, but who you’re with. Cherish, nurture and attend to your relationships."
  },
  {
    "slug": "arugula-salad-with-pancetta-and-mushrooms",
    "title": "Arugula Salad with Pancetta and Mushrooms",
    "description": "A delightful salad featuring the peppery taste of arugula, combined with sautéed mushrooms, pancetta, and goat cheese.",
    "image": "/arugula-salad-with-pancetta-and-mushrooms.jpg",
    "cookingTime": "20 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1 container Arugula",
      "1 8oz pkg baby bella mushrooms",
      "1 8oz pkg shitake mushroom mix",
      "Cubed pancetta",
      "Goat cheese",
      "3 Tbs olive oil",
      "Extra virgin olive oil and good balsamic vinegar",
      "Salt and pepper"
    ],
    "directions": [
      "Thinly slice mushrooms and sauté in olive oil, salt, and pepper.",
      "Sauté pancetta until slightly browned.",
      "Combine mushrooms and pancetta.",
      "Plate arugula.",
      "Top with mushrooms and pancetta.",
      "Crumble goat cheese.",
      "Drizzle with olive oil and balsamic vinegar."
    ],
    "quote": "Loyalty: Never betray those you love and love you. Betrayal has its on place in hell. An act that Dante reserved for his 9th ring of hell - not a fiery place but a place devoid of all warmth, all light, all basic human interaction leaving only unyielding ice. Read Dante’s Inferno."
  },
  {
    "slug": "chicken-with-crushed-castelvetrano-olive-vinegar-dressing",
    "title": "Chicken with Crushed Castelvetrano Olive Vinegar Dressing",
    "description": "A quick and flavorful chicken dish featuring juicy Castelvetrano olives, ideal for a weeknight dinner or impressing guests.",
    "image": "/chicken-with-crushed-castelvetrano-olive-vinegar-dressing.jpg",
    "cookingTime": "35 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 lbs chicken thighs or other parts",
      "Ground turmeric",
      "Olive oil – 6 tablespoons or thereabout",
      "Kosher salt and ground black pepper",
      "1/2 c. white wine vinegar",
      "1 ½ c. of green Castelvetrano olives pitted",
      "3 cloves minced garlic",
      "1 c. chopped flat leaf parsley"
    ],
    "directions": [
      "Heat oven to 450 degrees. Place chicken on rimmed baking sheet and coat with olive oil by hand.",
      "Season with salt, pepper and turmeric (need a teaspoon or so but just lightly coat). Pour vinegar on and around chicken.",
      "Bake chicken without flipping for 25-30 minutes.",
      "Combine crushed olives, garlic, parsley and about 4 tablespoons of olive oil and 2 tablespoons of water in a bowl. Salt and pepper.",
      "Once chicken is done, place on a serving platter. Add olive dressing to cooking pan. Stir, scraping up brown bits and chicken fat. Let rest for a minute or so then top the chicken with the dressing.",
      "Enjoy!"
    ],
    "quote": "Children are all sponges and more observant than a nun school teacher. Live your life accordingly. In other words, never embarrass your child and never diminish the pride they have in you. You will benefit more than them!"
  },
  {
    "slug": "standing-rib-roast",
    "title": "Standing Rib Roast – The King a.k.a. The Christmas Roast Beast",
    "description": "A decadent and savory prime rib roast, perfect for special occasions and family gatherings.",
    "image": "/standing-rib-roast.jpg",
    "cookingTime": "2 hours",
    "servings": "6 servings",
    "ingredients": [
      "3 ribs (or more) prime rib roast cut from the Chuck end",
      "Kosher salt",
      "Bay leaves",
      "Pink and black peppercorns",
      "Splash of vodka – not to drink!"
    ],
    "directions": [
      "Lightly wash roast with vodka.",
      "Cut small slits (6) to insert bay leaves (don’t insert yet).",
      "Salt liberally – kosher coarse salt.",
      "In a mortar and pestle crush pink peppercorns.",
      "Coat roast liberally with pink and black peppercorns.",
      "Insert bay leaves so half of the leaf is in the roast.",
      "Preheat oven to 450.",
      "Roast for 20 minutes then reduce oven to 350.",
      "Roast for approximately 1 ½ hours checking temp at 1 hour (rule of thumb is about 20 minutes per pound). 120 degrees for medium rare.",
      "Tent roast with aluminum foil and let rest for 30 minutes.",
      "Carve it up! Serve and watch what happens!"
    ],
    "quote": "Listen: The best conversationalists are the listeners. Listen to those you love. They may be screaming at you without saying a word."
  },
  {
    "slug": "jakes-steak-diane",
    "title": "Jake's Steak Diane (Old School)",
    "description": "If you want to do it right, prepare while sipping a dry Plymouth gin martini with a twist, playing Sinatra, stealing a kiss or two.",
    "image": "/jakes-steak-diane.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 prime filets pounded or cut to ¾ inch",
      "1 Tbs butter",
      "1 Tbs olive oil",
      "Shallot, minced",
      "2 garlic cloves, minced",
      "8 oz sliced white mushrooms",
      "1/4 c. cognac",
      "2 tsp dijon mustard",
      "1/4 c. heavy cream",
      "1/4 c. veal demi glaze",
      "2 tsp worcestershire sauce",
      "1 Tbs finely chopped scallions",
      "1 tsp finely chopped flat leaf parsley",
      "Salt and pepper"
    ],
    "directions": [
      "In a large well-seasoned cast iron skillet (which means you have to use it!), melt butter and olive oil.",
      "Sear meat with skillet on high about a minute per side (you are not cooking just searing).",
      "Remove and tent with foil. Turn down heat to medium.",
      "Add garlic, shallot, and stir until fragrant.",
      "Add mushrooms, salt and pepper, and sauté.",
      "Remove from heat, add cognac and ignite with a candle lighter.",
      "When alcohol is cooked off, add mustard, and cream. Stir. Whisk in demi glaze, Worcestershire, scallions, and parsley. Salt and pepper to taste.",
      "Return beef with juices. Coat thoroughly on simmer for a minute or two. Plate and cover with sauce."
    ],
    "quote": "Rice Krispie Treats: Make them with a small child and remember it’s all in the making."
  },
  {
    "slug": "pasta-with-olive-oil-and-garlic-sauce",
    "title": "Pasta with Olive Oil and Garlic Sauce",
    "description": "A simple yet flavorful pasta dish featuring olive oil, garlic, and anchovies for a satisfying meal.",
    "image": "/pasta-with-olive-oil-and-garlic-sauce.jpg",
    "cookingTime": "20 minutes",
    "servings": "4-6 servings",
    "ingredients": [
      "1/3 cup olive oil",
      "10 cloves of garlic, minced",
      "1/2 tsp red pepper flakes",
      "Non-pareil capers, well-drained and rinsed",
      "Anchovies – 4, minced with a light squeeze of lemon juice",
      "1 lb dried spaghetti",
      "Grated pecorino to taste"
    ],
    "directions": [
      "Bring salted water to a rolling boil (no oil!).",
      "Cook pasta as directed.",
      "In a preheated sauce pan, add oil, red pepper flakes, capers, and anchovy paste.",
      "Sauté for 2 minutes.",
      "Add garlic. Sauté until lightly golden.",
      "Add pasta to sauce pan and toss. Plate.",
      "Add pecorino to taste."
    ],
    "quote": "Raw Cookie Dough: Eat it. In other words, take calculated risks so you live your life to the fullest."
  },
  {
    "slug": "jakes-cowboy-steaks",
    "title": "Jake's Cowboy Steaks",
    "description": "A bold and flavorful steak rub combining coffee, sugar, and salt for a perfect outdoor grilling experience.",
    "image": "/jakes-cowboy-steaks.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1 ½ inch prime ribeye steaks (4)",
      "1/3 c. good ground coffee beans",
      "1/3 c. sugar in the raw",
      "1/3 c. kosher salt"
    ],
    "directions": [
      "Remove steaks from fridge an hour before cooking. Unwrap lightly covered with saran wrap.",
      "Combine dry rub ingredients.",
      "Cover steaks with a light coat of olive oil by hand.",
      "Apply rub to steaks on both sides generously about 30 minutes prior to cooking.",
      "Heat grill 10 minutes prior to cooking. Know your grill!",
      "Grill 4-5 minutes per side for medium rare.",
      "Sugar will caramelize, and the coffee and salt do the rest.",
      "Let rest 10 minutes and serve."
    ],
    "quote": "Stuff, Bling, Houses, Cars: True enjoyment never comes from stuff but what you do with it. You can’t possess a child’s love like a car, but must earn it. Use stuff for the betterment of others and wrap their joy and happiness around you like a blanket. I use this example: I took Jake to Super Bowl XL. It was my first and his too! Jake was 12. He loved it. Me, I loved watching him watch the game. I have long since forgotten the game, but not Jake’s joy. It still warms me."
  },
  {
    "slug": "mediterranean-chicken-breast",
    "title": "Mediterranean Chicken Breast",
    "description": "A savory chicken dish with Mediterranean toppings for a flavorful and versatile meal, adaptable to your taste.",
    "image": "/mediterranean-chicken-breast.jpg",
    "cookingTime": "40 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 skinless deboned chicken breasts",
      "3 Tbs olive oil",
      "Flour for dredging",
      "Salt and pepper",
      "Mediterranean topping - Julienned sun-dried tomatoes, sliced olives, capers, marinated artichokes, anchovies, shallots, garlic, diced chunky tomatoes, baby spinach"
    ],
    "directions": [
      "Pound chicken breasts to 1/2 inch.",
      "Salt and pepper each breast.",
      "Dredge in flour.",
      "Sauté in pan with 3 tablespoons of olive oil on medium high heat for 3 minutes per side.",
      "Remove breasts and tent with aluminum foil.",
      "Sauté Mediterranean ingredients of your choosing.",
      "Add chicken breasts back to pan with juices.",
      "Coat chicken breast with toppings and sauté for 3 more minutes.",
      "Plate chicken breasts and add toppings."
    ],
    "quote": "Dance: Dance when no one can hear the music except you."
  },
  {
    "slug": "seared-salmon-with-leeks-asparagus-tips-and-shiitake-mushrooms",
    "title": "Seared Salmon with Leeks, Asparagus Tips, and Shiitake Mushrooms with White Truffle Oil Drizzle",
    "description": "A delightful salmon dish served with fresh veggies and a touch of truffle oil for an elegant meal.",
    "image": "/seared-salmon-with-leeks-asparagus-tips-and-shiitake-mushrooms.jpg",
    "cookingTime": "25 minutes",
    "servings": "2-4 servings",
    "ingredients": [
      "Salmon filet of choice (preferably King salmon)",
      "Sliced shiitake mushrooms",
      "Sliced leeks (white only, carefully cleaned)",
      "Top 3 inches of asparagus spears cut into 1/2 inch pieces",
      "2 Tbs olive oil",
      "2 Tbs grape seed oil",
      "Salt and pepper",
      "Truffle oil"
    ],
    "directions": [
      "Sauté mushrooms, leeks, and asparagus in 2 tablespoons of olive oil.",
      "Season with salt and pepper.",
      "Set aside the vegetables.",
      "Sear salmon skin side up in 2 tablespoons of grape seed oil for 2-3 minutes.",
      "Flip salmon, cover pan with parchment paper, and simmer until salmon is medium-rare.",
      "Remove salmon from pan and salt to taste.",
      "Add topping and drizzle with white truffle oil. Enjoy!"
    ],
    "quote": "Travel: Go to the mountains. Go to the sea. Go everywhere in between."
  },
  {
    "slug": "lemon-chicken",
    "title": "Lemon Chicken (Everyone's Favorite!)",
    "description": "A classic lemon chicken recipe that's simple to prepare and always a hit with everyone.",
    "image": "/lemon-chicken.jpg",
    "cookingTime": "40 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 deboned and skinless chicken breasts",
      "Flour",
      "3 eggs",
      "1 Tbs fresh flat leaf parsley chopped",
      "2 lemons (zest and juice)",
      "6 Tbs butter (4 for lemon butter sauce)",
      "Salt and pepper"
    ],
    "directions": [
      "Preheat oven to 350 degrees.",
      "Pound chicken breasts to 3/4 inch (pound between cling wrap).",
      "Salt and pepper both sides.",
      "Dredge in flour. Shake off excess.",
      "Prepare an egg wash by adding 1 tablespoon chopped parsley and lemon zest to the eggs.",
      "Dredge chicken again in flour and egg wash.",
      "Lightly brown in skillet with butter on medium high heat for 3 minutes per side.",
      "Place in Pyrex baking dish.",
      "Bake for 10 minutes.",
      "While baking, melt 4-5 tablespoons of butter, add juice from 1 and 1/2 lemons, and 1 tablespoon chopped parsley.",
      "Remove chicken from oven.",
      "Pour butter lemon sauce over chicken and serve."
    ],
    "quote": "Passports: Get one. Don’t let it expire. Keep it handy. Use it – so you have to add pages!"
  },
  {
    "slug": "beer-bay-leaf-drunk-pork-shoulder",
    "title": "Beer and Bay Leaf Drunk Pork Shoulder",
    "description": "An aromatic and flavorful pork shoulder dish slow-cooked with beer, bay leaves, and spices, perfect for a hearty meal.",
    "image": "/beer-bay-leaf-drunk-pork-shoulder.jpg",
    "cookingTime": "3 hours",
    "servings": "6-8 servings",
    "ingredients": [
      "4 lbs boneless pork shoulder",
      "Minced garlic",
      "2 cans of beer",
      "5 bay leaves",
      "1 Tbs black peppercorns",
      "1 large onion - thinly sliced",
      "1 fennel bulb, thinly sliced",
      "Extra virgin olive oil",
      "1/4 c. dijon mustard",
      "1 tsp red pepper flakes",
      "Salt and pepper"
    ],
    "directions": [
      "Preheat oven to 375 degrees.",
      "Salt and pepper pork shoulder.",
      "Brown the roast in a Dutch oven with olive oil over high heat, then set aside.",
      "Lower heat to medium and drain excessive fat.",
      "Sauté onions, fennel, and red pepper flakes for 7-8 minutes. Add garlic and sauté for another 3 minutes.",
      "Add 2 cans of beer and 1 cup of water.",
      "Stir in mustard, add bay leaves, and black peppercorns.",
      "Return roast to Dutch oven. Bring to a boil.",
      "Cover and place in oven. Cook for one hour, then turn over the roast. Add beer if necessary.",
      "Cook for an additional hour.",
      "Rotate roast again. Cook for an additional 45 minutes without lid so liquid reduces.",
      "Shred and serve with onion and fennel, removing peppercorns and bay leaves."
    ],
    "quote": "Men plan, God laughs. Remember it, for perspective, for peace. Of course there is also “shit happens.”"
  },
  {
    "slug": "fettuccini-alfredo",
    "title": "Fettuccini Alfredo",
    "description": "The classic original recipe uses neither cream or egg yolks. It uses rare aged parmigiana reggiano, hand shredded for maximum melting and cream. My recipe “cheats” a bit! But, I’ve seen the smiles on you faces when I prepare it and that is what it’s all about!",
    "image": "/fettuccini-alfredo.jpg",
    "cookingTime": "20 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1 lb fresh fettuccini",
      "1 stick unsalted butter",
      "2 cloves minced garlic (optional)",
      "1 ½ c. heavy cream",
      "1 ½ c. hand shredded parmigiana-reggiano cheese",
      "1 egg yolk",
      "Salt and cracked black pepper",
      "1 Tbs chopped flat parsley as a garnish",
      "16 oz crumbled bacon/pancetta",
      "1 package baby peas"
    ],
    "directions": [
      "Heat 2 quarts salted water to a rolling boil.",
      "Melt stick of butter in a sauce pan.",
      "Add minced garlic if using.",
      "Add cream.",
      "Bring to a simmer and add shredded parmigiana and reggiano cheese.",
      "Stir and simmer until thickened.",
      "Cook fresh pasta for 3 minutes.",
      "Add pasta directly to pasta pot, hand draining only.",
      "Saute pasta with sauce.",
      "Add cracked pepper.",
      "Remove from heat. Add one egg yolk and blend.",
      "Add parsley.",
      "Serve and enjoy!",
      "(Note: for carbonana - cut butter in 1/2 and use bacon or pancetta drippings (2 tablespoons), add 16 oz crumbled bacon/pancetta at the end plus sautéed baby peas)"
    ],
    "quote": "Be serious but don’t take yourself seriously. None of us are all that. Honest humility is a goal even when you are out there slaying it."
  },
  {
    "slug": "citrus-marinated-rack-of-lamb-with-balsamic-glaze",
    "title": "Citrus Marinated Rack of Lamb with Balsamic Glaze",
    "description": "A succulent rack of lamb marinated in a citrus blend and served with a rich balsamic glaze.",
    "image": "/citrus-marinated-rack-of-lamb-with-balsamic-glaze.jpg",
    "cookingTime": "2 hours",
    "servings": "4 servings",
    "ingredients": [
      "2 locally raised racks of lamb, frenched",
      "1 Tbs fennel seed",
      "Juice of 2 lemons",
      "Juice of 2 oranges",
      "2 cloves of garlic",
      "2 Tbs olive oil",
      "2 tsp red pepper flakes",
      "1 Tbs kosher salt",
      "Salt and pepper",
      "For the glaze:",
      "- 1/2 c. balsamic vinegar",
      "- 1/2 c. red wine (dry)",
      "- 1/4 tsp red pepper flakes",
      "- 1 Tbs finely chopped rosemary",
      "- Sea salt"
    ],
    "directions": [
      "Blend fennel seeds, lemon juice, orange juice, garlic, olive oil, and red pepper flakes for 30 seconds (marinade).",
      "Place racks in a large container, meat side down and marinate for 6 hours in the fridge, reserve marinade.",
      "Turn grill on high. Let lamb sit at room temperature for 30 minutes.",
      "Salt and pepper lamb. Grill meat side down for 3 minutes to caramelize fat cap. Flip and grill 5 more minutes.",
      "Preheat oven to 400 degrees. Brush lamb with reserved marinade.",
      "Roast for 20 minutes and rest meat for 30 minutes.",
      "For the glaze:",
      "- Heat all ingredients (except rosemary) and simmer until reduced by half",
      "- Add rosemary",
      "- Brush on separated chops",
      "- Sprinkle with sea salt and serve"
    ],
    "quote": "Flowers: Keep fresh flowers in your home. They are a reminder of the natural beauty in this World."
  },
  {
    "slug": "chelseas-french-toast-with-bananas-foster",
    "title": "Chelsea's French Toast with Bananas Foster",
    "description": "A rich and indulgent breakfast treat featuring Challah bread French toast topped with a decadent bananas foster.",
    "image": "/chelseas-french-toast-with-bananas-foster.jpg",
    "cookingTime": "20 minutes",
    "servings": "4 servings",
    "ingredients": [
      "2 slices Challah bread per person",
      "3-4 eggs, beaten",
      "Salt and pepper to taste",
      "6 Tbs of butter",
      "1 banana per person - sliced",
      "1/3 c. brown sugar",
      "1/4 c. of dark rum",
      "Pure maple syrup or powdered sugar to taste"
    ],
    "directions": [
      "Slice bread to desired thickness and dip in egg wash.",
      "Grill in a cast iron skillet over medium-high heat using 2 tablespoons of butter. Cook all slices and set aside.",
      "Add 4 tablespoons of butter to the skillet on medium heat.",
      "Add bananas and brown sugar.",
      "Sauté until sugar melts and bananas soften.",
      "Turn to medium-high heat.",
      "Carefully add 1/4 cup dark rum and add flame to burn off alcohol.",
      "Plate French toast and add banana foster topping.",
      "Top with maple syrup or powdered sugar to taste.",
      "Enjoy!"
    ],
    "quote": "Champagne – Never say no. It’s been raised in a toast to celebrate all that’s good for centuries!"
  },
  {
    "slug": "porchetta-pork-roast",
    "title": "Porchetta Pork Roast",
    "description": "A flavorful and aromatic roasted pork shoulder, seasoned with herbs and spices for a delicious and tender dish.",
    "image": "/porchetta-pork-roast.jpg",
    "cookingTime": "6 hours",
    "servings": "8-10 servings",
    "ingredients": [
      "7-8 lbs pork shoulder, fat trimmed to 1/4 inch",
      "3 Tbs of fennel seed lightly toasted",
      "1 Tbs black peppercorns",
      "1 Tbs kosher salt",
      "1 tsp red pepper flakes",
      "8 cloves of garlic finely minced to a paste",
      "1/4 c. chopped fresh rosemary",
      "2 tsp chopped sage leaves",
      "Zest of 1 lemon",
      "1/4 c. olive oil",
      "4 Tbs olive oil"
    ],
    "directions": [
      "In a small food processor, combine 2 Tbs olive oil, black peppercorns, red pepper flakes, lemon zest, garlic, salt, toasted fennel seeds, sage, and rosemary. Blend.",
      "Rub the seasoning blend all over the roast. Place in a pan. Cover loosely with cling wrap and refrigerate overnight.",
      "Remove from refrigerator 2 hours before cooking. Heat oven to 425 degrees.",
      "Place roast on a rimmed baking sheet (fat side up). Drizzle with 2 Tbs olive oil. Roast for 35 minutes.",
      "Turn oven down to 300 degrees and roast for an additional 2 ½ to 3 ½ hours until internal temperature is 175 degrees.",
      "Let roast rest for 30 minutes.",
      "Carve and serve."
    ],
    "quote": "Don’t lie. Live by that tenant. Lies are selfish. Lies are never for the benefit of another… even small lies. Be trustworthy for your family and friends.Anything else is fraught with destruction."
  },
  {
    "slug": "chicken-veal-milanese",
    "title": "Chicken/Veal Milanese",
    "description": "Classic Italian dish featuring breaded and fried chicken or veal cutlets served with a fresh arugula and tomato salad.",
    "image": "/chicken-veal-milanese.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 skinned, de-boned chicken breasts or veal cutlets",
      "Flour for dredge",
      "1/3 c. each: panko, Italian seasoned bread crumbs and parmesan reggiano",
      "2 eggs for egg wash",
      "3 Tbs olive oil",
      "Baby arugula",
      "Cherry tomatoes, halved",
      "Shaved parmesan",
      "Salt and pepper",
      "Dressing:",
      "- 1/3 c. champagne vinegar",
      "- 1/3 cup olive oil",
      "- 1 Tbs minced shallot",
      "- 1 Tbs sugar",
      "- Fresh minced herbs (oregano and flat parsley)"
    ],
    "directions": [
      "If using chicken, pound between cling-wrap to 1/2 inch thickness.",
      "Heat pan with olive oil.",
      "Pre-heat oven to 350 degrees.",
      "Salt and pepper each side.",
      "Dredge in flour.",
      "Egg wash.",
      "Coat with bread crumbs mixture.",
      "Fry until golden on both sides.",
      "Place in cooking dish.",
      "Bake for 10-15 minutes.",
      "Plate with arugula and cherry tomatoes halved.",
      "Blend dressing ingredients by hand. Dress with Champaign vinegar shallot dressing.",
      "Top with shaved parmesan."
    ],
    "quote": "Sit silently by an outdoor wood-burning fire."
  },
  {
    "slug": "chicken-veal-parmesan",
    "title": "Chicken/Veal Parmesan",
    "description": "A comforting and classic Italian-American dish featuring breaded chicken or veal cutlets topped with marinara sauce and melted cheese.",
    "image": "/chicken-veal-parmesan.jpg",
    "cookingTime": "45 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 skinned, de-boned chicken breasts or 4 rib veal chops pounded to ¾ inch",
      "Flour",
      "1/3 c. each Panko, Italian seasoned bread crumbs and parmesan reggiano",
      "2 eggs",
      "2 Tbs olive oil",
      "1 Tbs butter",
      "8 oz hand-shredded mozzarella",
      "Sliced fresh buffalo mozzarella",
      "2 c. fresh marinara sauce (see marinara recipe)",
      "Chopped basil and flat leaf parsley for garnish"
    ],
    "directions": [
      "If using chicken, pound between cling-wrap to 1/2 inch thickness. No need for veal cutlets.",
      "Heat pan with 2 Tbs olive oil and butter (medium heat).",
      "Pre-heat oven to 350 degrees.",
      "Salt and pepper each side of cutlet.",
      "Dredge cutlet in flour. Shake off excess.",
      "Dip in beaten eggs for an egg wash.",
      "Coat with bread crumb mixture.",
      "Fry until golden brown on each side.",
      "Place in baking dish.",
      "Top with marinara, shredded, and sliced cheese.",
      "Bake for 15 minutes.",
      "Add garnish and sauce."
    ],
    "quote": "Spend time outdoors both day and night, sun and snow, rain and wind. Listen, look, feel, and learn."
  },
  {
    "slug": "rack-of-lamb-traditional",
    "title": "Rack of Lamb – Traditional",
    "description": "A classic preparation of rack of lamb coated with a Dijon mustard and rosemary mixture, roasted to perfection.",
    "image": "/rack-of-lamb-traditional.jpg",
    "cookingTime": "45 minutes",
    "servings": "4 servings",
    "ingredients": [
      "2 racks locally sourced if possible, frenched",
      "Salt and pepper",
      "4 Tbs fresh chopped rosemary",
      "3 Tbs Dijon mustard",
      "4 Tbs olive oil",
      "Bread crumbs",
      "4 cloves garlic, minced",
      "1/3 c. finely chopped parsley"
    ],
    "directions": [
      "In a small bowl, mix 3 tablespoons of Dijon mustard, 4 tablespoons of olive oil, and 2 tablespoons fresh chopped rosemary.",
      "Paint the racks with the mustard mixture on the meat side only. Tent racks together in a shallow pan.",
      "Pre-heat oven to 500 degrees.",
      "In a second bowl, mix 1 cup of bread crumbs, minced garlic, 4 tablespoons of olive oil, and finely chopped parsley.",
      "Put painted racks (without bread crumb mixture) in the oven and roast at 500 degrees for 10 minutes, remove from oven.",
      "Lower oven to 400 degrees.",
      "Pat meat side of racks with breadcrumb coating. Return to oven for 15 minutes.",
      "Remove and let rest for 10-15 minutes. Cut chops and serve.",
      "Enjoy!"
    ],
    "quote": "Be patient! To others, to children, and with yourself."
  },
  {
    "slug": "seared-sesame-encrusted-ahi",
    "title": "Seared Sesame Encrusted Ahi with Avocado, Soy, Ginger, and Lime",
    "description": "A sophisticated and flavorful dish featuring seared ahi tuna, coated in sesame seeds, complemented by a zesty sauce and fresh avocado.",
    "image": "/seared-sesame-encrusted-ahi.jpg",
    "cookingTime": "20 minutes",
    "servings": "4 servings",
    "ingredients": [
      "24 oz tuna (Sushi grade block cut)",
      "1/3 c. cilantro - chopped",
      "4 tsp grated fresh ginger",
      "4 garlic cloves - minced",
      "6 limes (for juice)",
      "6 Tbs soy sauce",
      "1 tsp sugar",
      "Salt and pepper",
      "2 Tbs olive oil",
      "Toasted and black sesame seeds",
      "3 ripe avocados"
    ],
    "directions": [
      "In a mixing bowl, combine finely chopped cilantro, grated fresh ginger, minced garlic, lime juice, soy sauce, sugar, salt, and pepper. Mix well.",
      "Heat a cast iron skillet over medium high heat and coat with 2 tablespoons of grape seed oil, olive oil is a suitable substitute.",
      "Season the tuna with salt and pepper and coat the top and bottom with toasted and black sesame seeds.",
      "Sear the tuna for one minute on each side. Shut off heat.",
      "Add half of the mixed ingredients, generously coating the tuna.",
      "Slice the tuna down and serve it with the remaining mixture as a topping along with sliced or chopped avocado.",
      "Finish with chopped cilantro and enjoy."
    ],
    "quote": "Dry your bed sheets outside as often as possible."
  },
  {
    "slug": "jean-georges-ginger-marinated-tuna-ribbons-with-avocado-and-radish-modified",
    "title": "Jean Georges Ginger Marinated Tuna Ribbons with Avocado and Radish Modified",
    "description": "An elegant appetizer or light meal featuring sushi-grade tuna ribbons marinated with ginger, paired with avocado and radish.",
    "image": "/jean-georges-ginger-marinated-tuna-ribbons-with-avocado-and-radish-modified.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1/4 c. fresh lime juice",
      "1/4 c. sugar",
      "2 Tbs roughly chopped cilantro or parsley",
      "1/2 c. peeled chopped fresh ginger or 1/4c. pureed ginger from the grocery store",
      "2 Tbs olive oil",
      "1/2 c. champagne vinegar",
      "1/2 c. soy sauce",
      "1 lb sushi grade block tuna steak",
      "1 shallot minced",
      "1 tsp red pepper flakes",
      "2 small avocados – diced",
      "4 red radishes, sliced 1/8 thickness soaked in ice water"
    ],
    "directions": [
      "Combine first three ingredients into a sauce pan and bring to a boil. Remove from heat. Strain and set aside.",
      "Puree ginger with 1 Tbs olive oil.",
      "In a bowl, combine ginger champagne vinegar, soy sauce, and ¼ cup of the lime syrup (ginger marinade).",
      "Slice tuna into ¼ inch thick strips. Further slice those into thinner ribbons.",
      "Toss with 2 Tbs olive oil, red pepper, and minced shallot. Lightly salt.",
      "Coat avocado with olive oil, lime juice, and lightly salt.",
      "Mound the avocado in 4 bowls.",
      "Top with half the radishes. Layer in the tuna ribbons and radishes. Top with tuna and a couple radish slices.",
      "Spoon 3 Tbs of ginger marinade around each mound and serve."
    ],
    "quote": "Never forget how proud I am of you."
  },
  {
    "slug": "original-pappys-beef-wellington",
    "title": "The 'Original Pappy’s' Beef Wellington",
    "description": "A classic and elegant Beef Wellington featuring a tender fillet encased in puff pastry with mushrooms, leeks, and pâté.",
    "image": "/original-pappys-beef-wellington.jpg",
    "cookingTime": "2 hours 30 minutes",
    "servings": "8 servings",
    "ingredients": [
      "4 lb fillet of beef, well-trimmed of silver skin",
      "1 lb Mixed mushroom (Bella and White) finely chopped",
      "2 stalks of leeks (white only) finely chopped",
      "8 oz Pate of fois gras or other liver pate (softened)",
      "2 sheets of Peppridge Farms puffed pastry",
      "1 Tbs chopped thyme",
      "Salt and pepper",
      "3 Tbs butter – unsalted",
      "1-2 eggs",
      "3 Tbs grape seed oil"
    ],
    "directions": [
      "Thaw and roll out puff pastry sheets to 1/4 thickness. Use flour as necessary. Combine sheets if needed for coverage of your filet using egg wash to attach separate sheets. Seam should run down the length of the filet.",
      "Measure and cut away extra pastry. Reserve for 'stars' or 'leaves' as an add-on.",
      "Salt and pepper filet. Sear all sides including the ends in a cast iron skillet with grape seed oil.",
      "Set aside to cool.",
      "In a separate skillet, add 3 tablespoons of butter. Sauté mushroom and leeks until dry with a tablespoon of fresh thyme. Low heat. Stir and let cool.",
      "Coat the browned filet with pâté. Apply mushroom leek mixture so the filet is completely coated.",
      "Place on your puff pastry and wrap. Seal with egg wash on the edges.",
      "Place filet seam side down in a baking pan. Brush entire pastry with egg wash. Cut 2 or 3 diagonal slits in the pastry.",
      "Chill for 1 1/2 hours.",
      "Bake at 400 degrees for 30 minutes. Reduce to 350 and bake for additional 10 minutes.",
      "Meat should register 120-125 on instant thermometer.",
      "Let rest for 15 minutes. Slice and serve!"
    ],
    "quote": ""
  },
  {
    "slug": "iron-skillet-shrimp-with-garlicky-basil-and-kalamata-sauce",
    "title": "Iron Skillet Shrimp with Garlicky Basil and Kalamata Sauce",
    "description": "A quick and delicious dish featuring fresh jumbo shrimp cooked in a flavorful garlicky basil and Kalamata olive sauce.",
    "image": "/iron-skillet-shrimp-with-garlicky-basil-and-kalamata-sauce.jpg",
    "cookingTime": "25 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1 lb fresh jumbo shrimp",
      "1/3 c. extra virgin olive oil",
      "1/3 c. marinara sauce",
      "Juice of one lemon",
      "4 cloves minced garlic",
      "1/2 c. fresh chopped basil",
      "1 tsp oregano",
      "Salt and pepper to taste",
      "1/2 tsp smoked paprika",
      "1/2 c. pitted Kalamata olives"
    ],
    "directions": [
      "Peel and de-vein shrimp.",
      "Mix all ingredients including shrimp in a bowl.",
      "Layer ingredients in an iron skillet.",
      "Bake at 450 degrees for 9 minutes.",
      "Enjoy! Clean cooking!"
    ],
    "quote": "Walk barefoot in the grass at sunrise."
  },
  {
    "slug": "creamy-tuscan-shrimp-and-scallops",
    "title": "Creamy Tuscan Shrimp and Scallops",
    "description": "A luscious dish combining shrimp and scallops in a creamy Tuscan-style sauce with sun-dried tomatoes and spinach.",
    "image": "/creamy-tuscan-shrimp-and-scallops.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "1/2 lb jumbo fresh sea scallops",
      "1/2 lb jumbo shrimp, peeled and deveined",
      "Kosher salt to taste",
      "Ground black peppercorns to taste",
      "3 Tbs butter or olive oil",
      "1 Tbs minced fresh garlic",
      "2 medium shallots minced",
      "1 c. chicken stock",
      "1 c. heavy cream",
      "3/4 c. sun dried tomatoes in oil, drained and julienned",
      "8 oz split cherry tomatoes",
      "3/4 c. shredded parmesan reggiano",
      "1/4 tsp oregano",
      "3 c. tightly packed fresh baby spinach"
    ],
    "directions": [
      "Pat dry scallops and shrimp (need to cook separately - shrimp take less time).",
      "Sear scallops over medium high heat in butter/olive oil. 2 minutes per side - only flip once. Transfer to plate.",
      "Cook shrimp. Add butter/oil if necessary. About 1 minute per side. Transfer to plate with scallops.",
      "Add 2 tablespoons of butter, sauté shallots for 2-3 minutes. Add garlic and sauté another minute.",
      "Add chicken stock, cream, sun dried tomatoes, cherry tomatoes, parmesan cheese, and oregano. Stir to combine.",
      "Bring to a boil. Reduce to simmer for 3-4 minutes. Add spinach. Cook 2 more minutes.",
      "Add shrimp and scallops.",
      "Serve over fresh fettuccini.",
      "Garnish with fresh chopped basil."
    ],
    "quote": "Laugh until you cry as often as possible."
  },
  {
    "slug": "creamy-tuscan-chicken",
    "title": "Creamy Tuscan Chicken",
    "description": "A rich and creamy chicken dish infused with the flavors of Tuscany, featuring sun-dried tomatoes, spinach, and a touch of garlic.",
    "image": "/creamy-tuscan-chicken.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4 chicken breasts, skinless and deboned, sliced in half horizontally and pounded to 1/2 inch thickness",
      "2 shallots, minced",
      "3 cloves of garlic, minced",
      "1 c. chicken stock or 1/2 c. stock and 1/2 c. dry white wine",
      "1 c. heavy cream",
      "3 Tbs olive oil",
      "3/4 c. drained, julienned sun-dried tomatoes",
      "4 c. sliced cherry tomatoes",
      "3/4 c. freshly grated Parmigiano Reggiano",
      "1/2 tsp dry oregano",
      "3 c. of tightly packed baby spinach",
      "Flour for dredging the chicken breasts",
      "Kosher salt and cracked pepper to taste"
    ],
    "directions": [
      "In a large cast iron skillet, heat 3 tablespoons of olive oil over medium-high heat.",
      "Salt and pepper pounded chicken, then dredge in flour.",
      "Shake off excess and brown on each side for about 3 minutes each. Set aside and tent with aluminum foil.",
      "In the same skillet, add olive oil and sauté minced shallot for 2-3 minutes, then add minced garlic for an additional minute.",
      "Deglaze the skillet with chicken stock or dry white wine, scraping up brown bits. Add oregano.",
      "Simmer on medium-high heat for about 5 minutes. Reduce heat to low and add cream and cheese.",
      "Stir the sauce and add the sun-dried tomatoes and sliced cherry tomatoes. Cook for an additional 5 minutes, being careful not to boil the cream.",
      "Add spinach and simmer for an additional 3 minutes. Salt and pepper to taste.",
      "Pour the sauce over the chicken and serve."
    ],
    "quote": "Remember to care for those that cared for you. It’s an honor to return the love you experienced."
  },
  {
    "slug": "iron-skillet-salmon-in-roasted-butter",
    "title": "Iron Skillet Salmon in Roasted Butter",
    "description": "Jake, “best salmon I ever had!”",
    "image": "/iron-skillet-salmon-in-roasted-butter.jpg",
    "cookingTime": "20 minutes",
    "servings": "2-4 servings",
    "ingredients": [
      "1 salmon fillet (preferably King salmon) - 1 1/2 to 2 lbs for 2-4 people",
      "1/2 stick of butter",
      "4 Tbs of minced herb either dill or parsley (parsley preferred)",
      "Salt and pepper to taste",
      "Lemon slices"
    ],
    "directions": [
      "Preheat oven to 475 degrees. Place a half of stick of butter in an iron skillet or roasting pan. Melt butter on stove and add 2 tablespoons of your herb. Place skillet in oven for 4 minutes until butter is brown and herbs are sizzling.",
      "Add salmon with salt and pepper, skin side up. Roast for 4 minutes.",
      "Remove from the oven. Take a fork inserting one prong under the skin and roll the skin off around the fork.",
      "Salt and pepper to taste.",
      "Flip salmon and roast another 3 minutes for medium rare.",
      "Plate and spoon some butter from pan. Spritz with lemon, garnish with remaining herbs.",
      "Enjoy!"
    ],
    "quote": "Put a smile on a child’s face. Smile such that the world smiles with you!"
  },
  {
    "slug": "basic-pomodoro-sauce-marinara",
    "title": "Basic Pomodoro Sauce (Marinara)",
    "description": "A rich and classic tomato sauce, perfect for pasta and a base for other Italian dishes.",
    "image": "/basic-pomodoro-sauce-marinara.jpg",
    "cookingTime": "2 hours 30 minutes",
    "servings": "6-8 servings",
    "ingredients": [
      "3 Tbs olive oil",
      "Medium white onion - minced",
      "2 - 28 oz cans Pomodoro S. Manzano Dell’agro Sarnese-Nocerino D.O.P. Certified Tomatoes",
      "Fresh basil",
      "1/4 c. vodka",
      "3 cloves of garlic – sliced to slivers",
      "Small can tomato paste",
      "Salt and pepper to taste"
    ],
    "directions": [
      "Heat olive oil in a dutch oven pot.",
      "Sauté onion until translucent.",
      "Add garlic (thinly sliced).",
      "Hand crush tomatoes into pot with juice, add paste, add 1/2 can water.",
      "Add 1/4 cup vodka.",
      "Simmer until the sauce is thickened.",
      "Once simmering, add a whole cluster of basil leaves.",
      "Simmer 1 hour and remove basil cluster.",
      "Simmer for another hour.",
      "Blend with hand emulsifier until smooth.",
      "Serve with your favorite pasta."
    ],
    "quote": "Generous: Be generous to those in need with both your time and your money, but especially with your time."
  },
  {
    "slug": "roasted-red-pepper-sauce",
    "title": "Roasted Red Pepper Sauce",
    "description": "A vibrant and velvety sauce made from roasted red peppers, perfect as a topping for meats.",
    "image": "/roasted-red-pepper-sauce.jpg",
    "cookingTime": "40 minutes",
    "servings": "4 servings",
    "ingredients": [
      "4-5 red peppers",
      "3 Tbs extra virgin olive oil",
      "Juice of half a lemon",
      "Salt to taste"
    ],
    "directions": [
      "Broil or grill red peppers until the skin is blackened, turning peppers as needed.",
      "Wrap peppers in aluminum foil after grilling. Let sit wrapped for 20 minutes to continue cooking.",
      "Let peppers cool, then cut and peel off the blackened skin, removing all skin and seeds.",
      "Place in a blender.",
      "Add olive oil and juice of 1/2 lemon. Season with salt to taste.",
      "Blend until smooth and serve.",
      "Optional: For a nice side dish, serve just the roasted peppers drizzled with olive oil and fresh minced garlic (salt to taste) and sliced Havarti cheese. This also serves as a nice sauce to accompany jumbo lump crab cakes."
    ],
    "quote": "Carry On: Learn to travel and live without baggage. Carry-on bag only. It’s all you need."
  },
  {
    "slug": "simple-bolognese",
    "title": "Simple Bolognese",
    "description": "Bolognese is really just meat sauce. Traditional mixes veal, beef and pork but you can also use short rib or even chuck roast if you want a shredded meat sauce.",
    "image": "/simple-bolognese.jpg",
    "cookingTime": "2 hours 30 minutes",
    "servings": "6-8 servings",
    "ingredients": [
      "1/2 lb each of ground veal, beef, and pork",
      "2 Tbs olive oil",
      "2 28 oz cans of Pomodoro S. Manzano Dor’agro Sarnese-Nocerino D.O.P. certified tomatoes - hand crushed with juice plus 1/2 can water",
      "1 medium-size yellow onion - chopped",
      "3 celery stalks, chopped",
      "2 carrots - chopped (mirepoix)",
      "4 cloves of garlic thinly sliced",
      "1 tsp red pepper flakes",
      "1/2 c. dry white wine or 1/4 cup vodka",
      "Fresh basil",
      "Salt and pepper",
      "1/4 c. heavy cream (optional)"
    ],
    "directions": [
      "Heat two tablespoons of olive oil in a Dutch oven on medium high heat.",
      "Brown the veal, beef, and pork in batches.",
      "Drain excess fat.",
      "Sauté mirepoix until softened.",
      "Add 1 teaspoon red pepper flakes.",
      "Add thinly sliced garlic and sauté until fragrant.",
      "Return browned meat to the Dutch oven and add hand-crushed tomatoes with juice and 1/2 can of water.",
      "Add wine or vodka.",
      "Bring to a simmer, reduce heat to low.",
      "Lay a group of basil leaves on top. Remove after an hour.",
      "Simmer for 2 hours, stirring occasionally.",
      "Spoon off excess oil if necessary.",
      "Turn off heat. Add cream if using.",
      "Serve over pasta and enjoy!"
    ],
    "quote": "Have children but know they aren’t really yours. They belong to the world. Cherish them. Love them."
  },
  {
    "slug": "marinara-sauce-with-a-fresh-twist",
    "title": "Marinara Sauce with a Fresh Twist",
    "description": "As you know, I have a love for canned Pomodoro S. Manzano Dell’agro Sarnese-Nocerino D.O.P. Certified Tomatoes. I use them in all my red sauces. I was playing around with my marinara sauce (chunkier than pomodoro, which I emulsify, but otherwise virtually identical ingredients) and added 3 twists! Which I think makes for a beautiful chunky marinara - perfect over dry pasta.",
    "image": "/marinara-sauce-with-a-fresh-twist.jpg",
    "cookingTime": "1 hour 30 minutes",
    "servings": "6-8 servings",
    "ingredients": [
      "2 - 28 oz cans of Pomodoro S. Manzano Dell’agro Sarnese-Nocerino D.O.P. Certified Tomatoes",
      "1 yellow onion, minced",
      "4 garlic cloves, sliced",
      "1 Tbs of dried oregano",
      "3/4 c. hand-torn fresh basil",
      "1 ½ c. sliced cherry tomatoes",
      "2 Tbs red wine vinegar",
      "3 Tbs olive oil"
    ],
    "directions": [
      "Sauté minced onion for about 10 minutes in olive oil over medium heat.",
      "Add slices of garlic and dried oregano, sauté 1 minute. Turn heat to low.",
      "Add Pomodoro tomatoes with juice, hand crushing the tomatoes into the sauce.",
      "Add basil and red wine vinegar.",
      "Simmer on low for about an hour.",
      "Add cherry tomatoes then turn off heat.",
      "Let rest for 20 minutes.",
      "Serve your chunky marinara over spaghetti and enjoy!"
    ],
    "quote": "The pain of a broken heart is worth the love. Trust me."
  },
  {
    "slug": "puttanesca-sauce",
    "title": "Puttanesca Sauce",
    "description": "(Not “Prostitute Sauce”, although its aroma will lure anyone into the kitchen, but “Delicious Sauce” - translation)",
    "image": "/puttanesca-sauce.jpg",
    "cookingTime": "30 minutes",
    "servings": "4 servings",
    "ingredients": [
      "3 Tbs olive oil",
      "5 cloves of garlic peeled and smashed",
      "5 anchovy filets (more or less to taste)",
      "1 28oz can whole plum tomatoes (drained)",
      "1/2 c. pitted oil-cured black olives (Kalamata olives work as well)",
      "2 Tbs drained capers",
      "Crushed red pepper flakes to taste",
      "Salt and pepper",
      "1 lb. spaghetti",
      "Chopped basil and Italian parsley for garnish"
    ],
    "directions": [
      "Medium-low heat, add olive oil to skillet. Use cast iron if possible.",
      "Sauté garlic and anchovies until garlic is golden.",
      "Crush drained tomatoes with hands into pan; add salt and pepper.",
      "Cook for 10 minutes on medium-high heat.",
      "Stir in all other ingredients and simmer to meld flavors (5-10 minutes).",
      "Add cooked pasta (al dente) to the skillet; toss to coat.",
      "Top with fresh herb garnish and serve.",
      "Enjoy!"
    ],
    "quote": "Compass - search for your moral compass. Find it. Follow it."
  },
  {
    "slug": "thai-shrimp-and-scallop-chowder",
    "title": "Thai Shrimp and Scallop Chowder",
    "description": "A flavorful and aromatic Thai-inspired chowder with succulent shrimp and scallops, enriched with coconut milk and fresh herbs.",
    "image": "/thai-shrimp-and-scallop-chowder.jpg",
    "cookingTime": "1 hour 20 minutes",
    "servings": "4 servings",
    "ingredients": [
      "2 qts (64 oz) chicken or seafood stock",
      "3 cloves of garlic peeled and crushed",
      "1/2 tsp red pepper flakes",
      "4 stalks fresh lemongrass, minced",
      "4 thick slices of peeled ginger root",
      "6 scallions, trimmed and minced",
      "2 Tbs of lime zest",
      "1/2 c. chopped fresh mint leaves",
      "1/2 c. chopped fresh basil",
      "1/2 c. chopped cilantro",
      "8 red potatoes - B size quartered",
      "1/2 lb cleaned and deveined shrimp",
      "1/2 lb scallops",
      "2 c. unsweetened coconut milk",
      "Salt and pepper"
    ],
    "directions": [
      "Sear scallops in brown butter in advance, 2 minutes per side on medium/high heat. Pre-cook shrimp in butter.",
      "In a saucepan, simmer for 1 hour: chicken stock, garlic, pepper flakes, lemon grass, and ginger.",
      "Strain stock and set aside.",
      "Heat strained stock over medium heat.",
      "Add potatoes and simmer (low boil) for 10 minutes.",
      "For garnish: In a bowl, mix scallions, lime zest, mint, basil, and cilantro.",
      "Reduce heat of stock.",
      "Add coconut milk, shrimp, and seared scallops. Ensure it does not boil, keep on low simmer for 5 minutes.",
      "Salt and pepper to taste.",
      "Plate soup and add garnish."
    ],
    "quote": "Sunrises – see as many as you can. Each new day is a gift. A fresh start. Full of opportunity. Make the most of it."
  }
]
